
use [master]

IF exists(select * from sys.databases where [name] ='TransportCompany')
begin
alter database [TransportCompany] set single_user with rollback IMMEDIATE;
drop database  [TransportCompany]
end
go
-- создаем БД
create database [TransportCompany]
go


use [TransportCompany]

----------------------------------------------------------
 -- создаем таблицу
----------------------------------------------------------
IF OBJECT_ID('[dbo].[Перевозки]', 'U') IS NOT NULL DROP TABLE [dbo].[Перевозки]

CREATE TABLE [dbo].[Перевозки] (
	[id] [int] IDENTITY(1,1) NOT NULL,
	[Дата рейса] [DateTime2]  NULL,
    [ФИО водителя]  [varchar] (50) NULL,
    [Номер машины]  [varchar] (20) NULL,
    [Груз (кг.)] [int] NULL,
    [Расход топлива (литр.)] [int] NULL,
    [Прибыль (руб.)] [int] NULL)
----------------------------------------------------------
-- наполнение данными
----------------------------------------------------------

INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '22.01.2024', 'Иванов Иван Иванович' ,'н111кр150', 11000, 130, 65000
		   )
----------------------------------------------------------

INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '23.01.2024', 'Петров Петр Петрович' ,'н222кр150', 10000, 160, 75000
		   )

---------------------------------------------------------
INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '24.01.2024', 'Федоров Федор Федорович' ,'н333кр150', 15000, 180, 95000
		   )


INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '28.01.2024', 'Федоров Федор Федорович' ,'н333кр150', 11500, 110, 115000
		   )


INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '18.02.2024', 'Федоров Федор Федорович' ,'н333кр150', 8500, 90, 65000
		   )

INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '23.02.2024', 'Петров Петр Петрович' ,'н222кр150', 11000, 150, 85000
		   )

INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '17.02.2024', 'Петров Петр Петрович' ,'н222кр150', 16000, 120, 85000
		   )


INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '22.02.2024', 'Иванов Иван Иванович' ,'н111кр150', 13500, 130, 75000
		   )
----------------------------------------------------------
INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '27.02.2024', 'Иванов Иван Иванович' ,'н111кр150', 15500, 120, 85000
		   )
----------------------------------------------------------
INSERT INTO [dbo].[Перевозки]
           ([Дата рейса]
           ,[ФИО водителя], 
            [Номер машины]
           ,[Груз (кг.)]
	       ,[Расход топлива (литр.)]
           ,[Прибыль (руб.)]
           )
     VALUES
           (
           '29.02.2024', 'Иванов Иван Иванович' ,'н111кр150', 14500, 230, 125000
		   )
----------------------------------------------------------

go